tests/load/rate-limit-test.yml
# Artillery Rate Limit Test Configuration
#
# To run: artillery run tests/load/rate-limit-test.yml
#
# This specifically tests rate limiting enforcement

config:
  target: "http://localhost:3001"
  phases:
    # Rapid fire to trigger rate limits
    - duration: 10
      arrivalRate: 20
      name: "Rate limit test"

scenarios:
  - name: "Rate Limit Enforcement Test"
    weight: 100
    flow:
      # Make rapid requests to trigger rate limiting
      - loop:
          - get:
              url: "/api/exploits"
              expect:
                - statusCode:
                    - 200
                    - 429 # Accept both success and rate limit responses
              capture:
                - header: "x-ratelimit-limit"
                  as: "rateLimit"
                - header: "x-ratelimit-remaining"
                  as: "rateLimitRemaining"
          count: 10